#include "Driver_Sleep.h"

/**************************************************
功能:ms延时，可以调用
输入:uint16 ms 延时时间
输出:无
***************************************************/
void SleepMs(uint16 ms)
{
    uint16 i;
    uint16 j;

    for(i=0;i<ms;i++)
		{	
			for(j=0;j<8100;j++);}
}


/**************************************************
功能:us延时，可以调用
输入:uint16 us 延时时间
输出:无
***************************************************/
void SleepUs(uint16 us)
{
    uint16 i;
    uint16 j;

    for(i=0;i<us;i++)
    {
      for(j=0;j<8;j++);}
}

